KCX-Mapping-Convert/testdaten/EMCS-V20/UidsFromKids/EMCSSubmittedDraftOfSplittingOperation.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Header xmlns="http://www.eurtradenet.com/schemas/header/200310" soap:mustUnderstand="true"><To>DE01.CSFALT.2144</To><From>DE.CSF</From><MessageID>EI20100519</MessageID><SentAt>2011-08-19 12:02:00 +0200</SentAt><Act>request</Act><Method>EMCS</Method><MessageVersion>2.0</MessageVersion></Header></soap:Header><soap:Body><Submit xmlns="http://www.eurtradenet.com/schemas/uids/emcs/body/200911"><EMCS><EMCSSubmittedDraftOfSplittingOperation><LocalReferenceNumber>LocalReferenceNumber</LocalReferenceNumber><UpstreamARC>UpstreamARC</UpstreamARC><MemberStateCode>MemberStateCode</MemberStateCode><SplitDetailsEAD><ReferenceNumber>ReferenceNumber</ReferenceNumber><JourneyTime>JourneyTime</JourneyTime><ChangedTransportArrangement>ChangedTransportArrangement</ChangedTransportArrangement><ChangedDestination><DestinationTypeCode>DestinationTypeCode</DestinationTypeCode><NewConsigneeTrader><CustomerID>CustomerID-NewTransportArranger</CustomerID><VATID>VATID-NewTransportArranger</VATID><Address><Name>Name-NewTransportArranger</Name><Street>StreetAndNumber-NewTransportArranger</Street><PostalCode>PostalCode-NewTransportArranger</PostalCode><City>City-NewTransportArranger</City><Language>CE</Language></Address></NewConsigneeTrader><DeliveryPlaceTrader><CustomerID>CustomerID-NewTransporter</CustomerID><VATID>VATID-NewTransporter</VATID><Address><Name>Name-NewTransporter</Name><Street>StreetAndNumber-NewTransporter</Street><PostalCode>PostalCode-NewTransporter</PostalCode><City>City-NewTransporter</City><Language>CE</Language></Address></DeliveryPlaceTrader><DeliveryPlaceCustomsOffice>DeliveryPlaceCustomsOffice</DeliveryPlaceCustomsOffice></ChangedDestination><NewTransportArrangerTrader><CustomerID>CustomerID-NewTransportArranger</CustomerID><VATID>VATID-NewTransportArranger</VATID><Address><Name>Name-NewTransportArranger</Name><Street>StreetAndNumber-NewTransportArranger</Street><PostalCode>PostalCode-NewTransportArranger</PostalCode><City>City-NewTransportArranger</City><Language>CE</Language></Address></NewTransportArrangerTrader><NewTransporterTrader><CustomerID>CustomerID-NewTransporter</CustomerID><VATID>VATID-NewTransporter</VATID><Address><Name>Name-NewTransporter</Name><Street>StreetAndNumber-NewTransporter</Street><PostalCode>PostalCode-NewTransporter</PostalCode><City>City-NewTransporter</City><Language>CE</Language></Address></NewTransporterTrader><TransportDetails><TransportUnitCode>1</TransportUnitCode><IdentityOfTransportUnits>IdentityOfTransportUnits1</IdentityOfTransportUnits><CommercialSealIdentification>CommercialSealIdentification1</CommercialSealIdentification><ComplementaryInformation language="AA">ComplementaryInformation1</ComplementaryInformation><SealInformation language="AA">SealInformation1</SealInformation></TransportDetails><TransportDetails><TransportUnitCode>2</TransportUnitCode><IdentityOfTransportUnits>IdentityOfTransportUnits2</IdentityOfTransportUnits><CommercialSealIdentification>CommercialSealIdentification2</CommercialSealIdentification><ComplementaryInformation language="AA">ComplementaryInformation2</ComplementaryInformation><SealInformation language="AA">SealInformation2</SealInformation></TransportDetails><BodyEaad><BodyRecordUniqueReference>1</BodyRecordUniqueReference><ExciseProductCode>A000</ExciseProductCode><CnCode>00000000</CnCode><CommercialDescription language="AA">CommercialDescription</CommercialDescription><BrandNameOfProducts language="AA">BrandNameOfProducts</BrandNameOfProducts><FiscalMarkUsedFlag>0</FiscalMarkUsedFlag><FiscalMark language="AA">FiscalMark</FiscalMark><Quantity>0</Quantity><Density>0</Density><NetWeight>0</NetWeight><GrossWeight>0</GrossWeight><Package><KindOfPackages>aa</KindOfPackages><NumberOfPackages>1</NumberOfPackages><CommercialSealIdentification>CommercialSealIdentification</CommercialSealIdentification><SealInformation language="AA">SealInformation</SealInformation></Package><Package><KindOfPackages>aa</KindOfPackages><NumberOfPackages>2</NumberOfPackages><CommercialSealIdentification>CommercialSealIdentification</CommercialSealIdentification><SealInformation language="AA">SealInformation</SealInformation></Package><Package><KindOfPackages>aa</KindOfPackages><NumberOfPackages>3</NumberOfPackages><CommercialSealIdentification>CommercialSealIdentification</CommercialSealIdentification><SealInformation language="AA">SealInformation</SealInformation></Package><Package><KindOfPackages>aa</KindOfPackages><NumberOfPackages>4</NumberOfPackages><CommercialSealIdentification>CommercialSealIdentification</CommercialSealIdentification><SealInformation language="AA">SealInformation</SealInformation></Package></BodyEaad></SplitDetailsEAD></EMCSSubmittedDraftOfSplittingOperation></EMCS></Submit></soap:Body></soap:Envelope>
